tutorials/cfdemSolverPisoMS/ErgunTestMPI/CFD/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0.1);

boundaryField
{

    wall
    {
        //type            fixedValue;
        //value           uniform (0 0 0);
        type            slip;
    }

    inlet
    {
        /*type            flowRateInletVelocity;
        flowRate        0.001;
        value           uniform (0 0 0);*/

/*        type            fixedValue;
        value           uniform (0 0 0.1);*/

        //type            zeroGradient;

        /*// superficial velocity BC
        type            groovyBC;
        variables       "Usup=vector(0,0,2);alpha=voidfraction;tEnd=0.1;"; // should be used with zeroGradient voidfraction
        valueExpression "((time() < tEnd) ? Usup/alpha*(time()/tEnd) :  Usup/alpha)";
        value           uniform (0 0 0);*/

        /*// 2.0.x, ext
        type            timeVaryingUniformFixedValue;
        fileName        "steps_0p1s";
        outOfBounds     clamp;
        value           uniform (0 0 0);*/

        // 2.1.x
        type            uniformFixedValue;
        uniformValue     table
        (
        (0.000 (0 0 0.))
        (0.099 (0 0 2))
        (0.100 (0 0 2))
        );
    }
    outlet
    {
        /*type            fluxCorrectedVelocity; //inletOutlet;
        value           uniform (0 0 0);
        inletValue      uniform (0 0 0);*/
        type            zeroGradient;
    }
}

// ************************************************************************* //
